server/app/graphql/mutations/create_post.rb

    def resolve(title:, body:)
      post = Post.new(title: title, body: body)
      # Here returns post field, which is defined above.
      if post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "blue"], ["body", "bbb"], ["created_at", "2020-07-25 21:38:31.153062"], ["updated_at", "2020-07-25 21:38:31.153062"]]