server/app/graphql/mutations/delete_post.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
    def resolve(id:)
      post = Post.find(id)
      if post.destroy