server/app/graphql/mutations/update_post.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "asfsaddfads"], ["body", "asdfs"], ["updated_at", "2020-07-25 21:37:51.388493"], ["id", 1]]
---
    def resolve(id:, attributes:)
      post = Post.find(id)
      if post.update(attributes.to_h)