server/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asdfsa"], ["body", "asfsdf"], ["created_at", "2020-07-25 21:26:29.430172"], ["updated_at", "2020-07-25 21:26:29.430172"]]
---
  def create
    @post = Post.create!(post_params)