server/app/graphql/subscriptions/post_updated.rb

    def update(id:)
      print 'post updated'
      post = Post.find(id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]